ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_СписаниеТоплива/УТЗ_ПЛ_СписаниеТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_СписаниеТоплива</name>
  <registerRecords>InformationRegister.УТЗ_ПЛ_ЗаблокированныеДокументы</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКСписанию</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяСписания</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛист</name>
      <type>
        <types>DocumentRef.УТЗ_ПЛ_ПутевойЛист</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_СтатусыСписанияТоплива/УТЗ_ПЛ_СтатусыСписанияТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_СтатусыСписанияТоплива</name>
  <enumValues>
    <name>ВнутреннееПотреблениеНеСоздано</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотреблениеСоздано</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотреблениеПроведено</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_СписаниеТоплива/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОбновитьСтатус();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументВнутреннееПотреблениеПриИзменении(Элемент)
	ОбновитьСтатус();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СоздатьДокумент(Команда)
	
	ТекстВопроса = "Создать документ ""Внутреннее потребление"" на основании данных, указанных в этом документе?";
	Если Не Ждать ПоложительныйОтветНаВопрос(ТекстВопроса) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументВнутреннееПотребление();
	
	Если ЗначениеЗаполнено(Объект.ДокументВнутреннееПотребление) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Объект.ДокументВнутреннееПотребление);
		ОткрытьФорму("Документ.ВнутреннееПотребление.Форма.ФормаДокумента"
		, ПараметрыФормы
		, ЭтотОбъект
		, УникальныйИдентификатор);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РежимЗаписи",      РежимЗаписиДокумента.Запись);
	ПараметрыОповещения.Вставить("ЕстьРаспоряжение", Ложь);
	
	Оповестить("Запись_ВнутреннееПотребление", ПараметрыОповещения);
	
	ОбновитьСтатус();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция ПоложительныйОтветНаВопрос(ТекстВопроса)
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Возврат Ответ = КодВозвратаДиалога.Да;
КонецФункции

&НаСервере
Процедура СоздатьДокументВнутреннееПотребление()
	НовыйДокумент = Документы.ВнутреннееПотребление.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("ВидЦены");
	МассивПараметров.Добавить("НаправлениеДеятельности");
	МассивПараметров.Добавить("Организация");
	МассивПараметров.Добавить("Подразделение");
	МассивПараметров.Добавить("ПотреблениеДляДеятельности");
	МассивПараметров.Добавить("Склад");
	МассивПараметров.Добавить("ХозяйственнаяОперация");	
	
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Объект, СтрСоединить(МассивПараметров, ","));
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокумент.Комментарий = "Создано на основании """ + Объект.Ссылка + """";
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.КоличествоУпаковок = СтрокаТЧ.Количество;
	КонецЦикла;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	
	Объект.ДокументВнутреннееПотребление = НовыйДокумент.Ссылка;
	
	Записать();
	
	ОбновитьСтатус();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатус()
	
	Если Не ЗначениеЗаполнено(Объект.ДокументВнутреннееПотребление) Тогда
		Статус = Перечисления.УТЗ_ПЛ_СтатусыСписанияТоплива.ВнутреннееПотреблениеНеСоздано;
	Иначе
		ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументВнутреннееПотребление
																	, "Проведен"
																	, Истина);
		Если ТипЗнч(ДокументПроведен) = Тип("Булево") Тогда
			Если ДокументПроведен Тогда
				Статус = Перечисления.УТЗ_ПЛ_СтатусыСписанияТоплива.ВнутреннееПотреблениеПроведено;
			Иначе
				Статус = Перечисления.УТЗ_ПЛ_СтатусыСписанияТоплива.ВнутреннееПотреблениеСоздано;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры





#КонецОбласти
